from django.utils.translation import gettext_lazy as _

SELECT_PART = (
    ('Eat', _('먹다')),
    ('Drink', _('마시다')),
    ('Fun', _('놀다')),
    # ('See', _('보다')),
    ('Sleep', _('자다')),
    ('Buy', _('사다'))
)

SELECT_TYPE = (
    (1, _('Must')),
    (2, _('Hot')),
    (3, _('Normal'))
)

SELECT_COURSE = (
    ('One-Hours', _('1시간')),
    ('Half-Day', _('반나절')),
    ('One-Day', _('하루'))
)

ASSET_CHOICES = (
   ('M', _('자산')),
   ('N', _('공용'))
)

SELECT_CATEGORY_TEMP = (
    (1, _('문화유적')),
    (2, _('랜드마크')),
    (3, _('거리')),
    (4, _('공원')),
    (5, _('박물관')),
    (6, _('종교')),
    (7, _('자연')),
    (8, _('시장')),
    (9, _('교통')),
    (10, _('공공')),
    (11, _('Place'))
)
SELECT_CATEGORY = (
    ('Cultural-Heritage', _('문화유적')),
    ('Landmark', _('랜드마크')),
    ('Street', _('거리')),
    ('Park', _('공원')),
    ('Museum', _('박물관')),
    ('Religion', _('종교')),
    ('Nature', _('자연')),
    ('Market', _('시장')),
    ('Traffic', _('교통')),
    ('Public', _('공공')),
    ('Place', _('장소'))
)

SELECT_GOTOCITY = (
    (1, _('Seoul')),
    (2, _('Busan'))
)

SELECT_EATPIN = (
    (1, _('담백한')),
    (2, _('화끈한')),
    (3, _('새콤달콤한')),
    (4, _('전통적인')),
    (5, _('국물이있는')),
    (6, _('볶음요리')),
    (7, _('해산물')),
    (8, _('BBQ')),
    (9, _('채식'))
)

SELECT_DRINKPIN = (
    (1, _('커피')),
    (2, _('차')),
    (3, _('쥬스')),
    (4, _('분위기있는')),
    (5, _('조용한')),
    (6, _('풍경이좋은')),
    (7, _('케이크')),
    (8, _('도너츠')),
    (9, _('베이커리'))
)

SELECT_FUNPIN = (
    (1, _('체험여행')),
    (2, _('문화여행')),
    (3, _('역사여행')),
    (4, _('아웃도어')),
    (5, _('전망이좋은')),
    (6, _('야경이좋은')),
    (7, _('놀이공원')),
    (8, _('랜드마크')),
    (9, _('산책'))
)

SELECT_BUYPIN = (
    (1, _('패션')),
    (2, _('화장품')),
    (3, _('과자')),
    (4, _('전통시장')),
    (5, _('특산물')),
    (6, _('김')),
    (7, _('아몬드')),
    (8, _('기념품')),
    (9, _('대형마트'))
)

SELECT_ORDER_NUM = (
    (0, 'Select order'),
    (1, '1'),(2, '2'),(3, '3'),(4, '4'),(5, '5'),(6, '6'),(7, '7'),(8, '8'),(9, '9'),(10, '10'),
    (11, '11'),(12, '12'),(13, '13'),(14, '14'),(15, '15'),(16, '16'),(17, '17'),(18, '18'),(19, '19'),(20, '20')
)